mikeakohn/naken_asm/asm/stm8.cpp
/**
 *  naken_asm assembler.
 *  Author: Michael Kohn
 *   Email: mike@mikekohn.net
 *     Web: https://www.mikekohn.net/
 * License: GPLv3
 *
 * Copyright 2010-2026 by Michael Kohn
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "asm/common.h"
#include "asm/stm8.h"
#include "core/AsmContext.h"
#include "core/tokens.h"
#include "core/eval_expression.h"
#include "disasm/stm8.h"
#include "table/stm8.h"

enum
{
  NUM_SIZE_SHORT,
  NUM_SIZE_WORD,
  NUM_SIZE_EXTENDED,
  NUM_SIZE_UNKNOWN,
};

struct _operand
{
  uint8_t type;
  uint8_t reg;
  uint8_t num_size;
  int value;
};

int find_bigger_instruction(int n)
{
  switch (table_stm8_opcodes[n].type)
  {
    case OP_NUMBER8:
      if (table_stm8_opcodes[n+1].type == OP_NUMBER16)
      {
        return n + 1;
      }
      break;
    case OP_ADDRESS8:
      if (table_stm8_opcodes[n+1].type == OP_ADDRESS16)
      {
        return n + 1;
      }
      break;
    case OP_OFFSET8_INDEX_X:
      if (table_stm8_opcodes[n+1].type == OP_OFFSET16_INDEX_X)
      {
        return n + 1;
      }
      break;
    case OP_OFFSET8_INDEX_Y:
      if (table_stm8_opcodes[n+1].type == OP_OFFSET16_INDEX_Y)
      {
        return n + 1;
      }
      break;
    case OP_INDIRECT8:
      if (table_stm8_opcodes[n+1].type == OP_INDIRECT16)
      {
        return n + 1;
      }
      break;
    case OP_INDIRECT8_X:
      if (table_stm8_opcodes[n+1].type == OP_INDIRECT16_X)
      {
        return n + 1;
      }
      break;
    case OP_INDIRECT8_Y:
      if (table_stm8_opcodes[n+1].type == OP_INDIRECT16_Y)
      {
        return n + 1;
      }
      break;
    case OP_ADDRESS8_ADDRESS8:
      if (table_stm8_opcodes[n+1].type == OP_ADDRESS16_ADDRESS16)
      {
        return n + 1;
      }
      break;
    default:
      break;
  }

  return n;
}

static int ignore_expression(AsmContext *asm_context)
{
  char token[TOKENLEN];
  int token_type;

  // Ignore all tokens until an ',' or ']' or EOL
  while (1)
  {
    token_type=tokens_get(asm_context, token, TOKENLEN);

    if (IS_TOKEN(token,',') || IS_TOKEN(token,']') ||
        token_type == TOKEN_EOL || token_type == TOKEN_EOF)
    {
      tokens_push(asm_context, token, token_type);
      return 0;
    }
  }

  return -1;
}

static int get_num(
  AsmContext *asm_context,
  int instr_index,
  int *num,
  int *num_size)
{
  if (eval_expression(asm_context, num) != 0)
  {
    if (asm_context->pass == 1)
    {
      ignore_expression(asm_context);
      //*num_size = get_minimum_size(instr_index);
      *num_size = NUM_SIZE_UNKNOWN;
      asm_context->memory_write(asm_context->address, *num_size, asm_context->tokens.line);
      return 0;
    }

    print_error_illegal_expression(asm_context, table_stm8[instr_index].instr);
    return -1;
  }

  int override_size = asm_context->memory_read(asm_context->address);

  if (asm_context->pass == 2 && override_size != 0)
  {
    *num_size = override_size;
    return 0;
  }

  if (*num >= -128 && *num <= 0xff) { *num_size = NUM_SIZE_SHORT; return 0; }
  if (*num >= -32768 && *num <= 0xffff) { *num_size = NUM_SIZE_WORD; return 0; }
  if (*num >= -8388608 && *num <=0xffffff) { *num_size = NUM_SIZE_EXTENDED; return 0; }

  // FIXME - bad error message
  print_error_range(asm_context, "number", 0, 0xffffff);

  return -1;
}

static int add_bin_void(AsmContext *asm_context, int n)
{
  int count = 1;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
    count++;
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);

  return count;
}

static int add_bin_num8(AsmContext *asm_context, int n, int num)
{
  int count = 2;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, num, IS_OPCODE);

  return count;
}

static int add_bin_num16(AsmContext *asm_context, int n, int num)
{
  int count = 3;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, (num >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num & 0xff, IS_OPCODE);

  return count;
}

static int add_bin_num24(AsmContext *asm_context, int n, int num)
{
  int count = 4;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, (num >> 16) & 0xff, IS_OPCODE);
  add_bin8(asm_context, (num >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num & 0xff, IS_OPCODE);

  return count;
}

static int add_bin_bit(AsmContext *asm_context, int n, int num, int pos)
{
  int count = 3;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode | (pos << 1), IS_OPCODE);
  add_bin8(asm_context, (num >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num & 0xff, IS_OPCODE);

  return count;
}

static int add_bin_bit_offset(
  AsmContext *asm_context,
  int n,
  int num,
  int pos,
  int offset)
{
  int count = 4;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode | (pos << 1), IS_OPCODE);
  add_bin8(asm_context, (num >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num & 0xff, IS_OPCODE);
  add_bin8(asm_context, ((uint8_t)offset) & 0xff, IS_OPCODE);

  return count;
}

static int add_bin_num16_num8(
  AsmContext *asm_context,
  int n,
  int num1,
  int num2)
{
  int count = 4;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, num2 & 0xff, IS_OPCODE);
  add_bin8(asm_context, (num1 >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num1 & 0xff, IS_OPCODE);

