mikeakohn/naken_asm/asm/stm8.cpp
  return count;
}

static int add_bin_num8_num8(
  AsmContext *asm_context,
  int n,
  int num1,
  int num2)
{
  int count = 3;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, num2 & 0xff, IS_OPCODE);
  add_bin8(asm_context, num1 & 0xff, IS_OPCODE);

  return count;
}

static int add_bin_num16_num16(
  AsmContext *asm_context,
  int n,
  int num1,
  int num2)
{
  int count = 5;

  if (table_stm8_opcodes[n].prefix != 0)
  {
    add_bin8(asm_context, table_stm8_opcodes[n].prefix, IS_OPCODE);
    count++;
  }
  add_bin8(asm_context, table_stm8_opcodes[n].opcode, IS_OPCODE);
  add_bin8(asm_context, (num2 >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num2 & 0xff, IS_OPCODE);
  add_bin8(asm_context, (num1 >> 8) & 0xff, IS_OPCODE);
  add_bin8(asm_context, num1 & 0xff, IS_OPCODE);

  return count;
}

int parse_instruction_stm8(AsmContext *asm_context, char *instr)
{
  char instr_case[TOKENLEN];
  char token[TOKENLEN];
  struct _operand operands[3];
  int operand_count;
  int has_unknown_size;
  int instr_enum;
  int instr_index;
  int token_type;
  int num_size;
  int n;

  lower_copy(instr_case, instr);
  operand_count = 0;
  memset(operands, 0, sizeof(operands));

  if (strcmp(instr_case, "sla") == 0)
  {
    // Alias SLA as SLL
    strcpy(instr_case, "sll");
  }
    else
  if (strcmp(instr_case, "slaw") == 0)
  {
    // Alias SLAW as SLLW
    strcpy(instr_case, "sllw");
  }

  // Find instruction
  n = 0;
  while (table_stm8[n].instr != NULL)
  {
    if (strcmp(instr_case, table_stm8[n].instr) == 0) { break; }
    n++;
  }

  if (table_stm8[n].instr == NULL)
  {
    print_error_unknown_instr(asm_context, instr);
    return -1;
  }

  instr_index = n;
  instr_enum = table_stm8[n].instr_enum;

  // Parse operands
  while (1)
  {
    token_type = tokens_get(asm_context, token, TOKENLEN);

    if (token_type == TOKEN_EOL || token_type == TOKEN_EOF)
    {
      break;
    }

    if (operand_count == 3)
    {
      print_error_unexp(asm_context, token);
      return -1;
    }

    if (operand_count != 0)
    {
      if (IS_NOT_TOKEN(token,','))
      {
        print_error_unexp(asm_context, token);
        return -1;
      }

      token_type = tokens_get(asm_context, token, TOKENLEN);
    }

    if (strcasecmp(token,"A") == 0)
    {
      operands[operand_count].type = OP_REG_A;
    }
      else
    if (strcasecmp(token,"X") == 0)
    {
      operands[operand_count].type = OP_REG_X;
    }
      else
    if (strcasecmp(token,"Y") == 0)
    {
      operands[operand_count].type = OP_REG_Y;
    }
      else
    if (strcasecmp(token,"XL") == 0)
    {
      operands[operand_count].type = OP_REG_XL;
    }
      else
    if (strcasecmp(token,"YL") == 0)
    {
      operands[operand_count].type = OP_REG_YL;
    }
      else
    if (strcasecmp(token,"XH") == 0)
    {
      operands[operand_count].type = OP_REG_XH;
    }
      else
    if (strcasecmp(token,"YH") == 0)
    {
      operands[operand_count].type = OP_REG_YH;
    }
      else
    if (strcasecmp(token,"CC") == 0)
    {
      operands[operand_count].type = OP_REG_CC;
    }
      else
    if (strcasecmp(token,"SP") == 0)
    {
      operands[operand_count].type = OP_SP;
    }
      else
    if (IS_TOKEN(token,'#'))
    {
      if (get_num(asm_context, instr_index, &n, &num_size) != 0)
      {
        return -1;
      }

      switch (num_size)
      {
        case NUM_SIZE_SHORT:
          operands[operand_count].type = OP_NUMBER8; break;
        case NUM_SIZE_WORD:
          operands[operand_count].type = OP_NUMBER16; break;
        default:
          // FIXME - bad error message
          //print_error_range(asm_context, instr, 0, 0xff);
          //return -1;
          operands[operand_count].type = OP_NUMBER8; break;
          break;
      }

      operands[operand_count].value = n;
      operands[operand_count].num_size = num_size;
    }
      else
    if (IS_TOKEN(token,'('))
    {
      token_type = tokens_get(asm_context, token, TOKENLEN);

      if (IS_TOKEN(token,'['))
      {
        if (get_num(asm_context, instr_index, &n, &num_size) != 0)
        {
          return -1;
        }

        operands[operand_count].value = n;
        operands[operand_count].num_size = num_size;

        uint8_t is_w = 1;
        uint8_t is_e = 0;
        uint8_t skip_case = 0;

        token_type = tokens_get(asm_context, token, TOKENLEN);
        if (IS_TOKEN(token,'.'))
        {
          token_type = tokens_get(asm_context, token, TOKENLEN);
          if (strcasecmp(token, "e") == 0)
          {
            // REVIEW: Look over why these are set like this.
            is_w = 0;
            is_e = 1;
          }
            else
          if (strcasecmp(token, "w") != 0)
          {
            print_error_unexp(asm_context, token);
            return -1;
          }
        }
          else
        {
          tokens_push(asm_context, token, token_type);
        }

        if (expect_token(asm_context, ']') == -1) { return -1; }
        if (expect_token(asm_context, ',') == -1) { return -1; }

        token_type = tokens_get(asm_context, token, TOKENLEN);
        if (strcasecmp(token,"X") == 0)
        {
          operands[operand_count].type = OP_INDIRECT8_X;

          if (is_e == 1)
          {
            operands[operand_count].type = OP_INDIRECT16_E_X;
            skip_case = 1;
            if (check_range(asm_context, "address", operands[operand_count].value, 0, 0xffff) == -1) { return -1; }
          }
        }
          else
        if (strcasecmp(token,"Y") == 0)
        {
          operands[operand_count].type = OP_INDIRECT8_Y;

          if (is_e == 1)
          {
            operands[operand_count].type = OP_INDIRECT16_E_Y;
            skip_case = 1;
            if (check_range(asm_context, "address", operands[operand_count].value, 0, 0xffff) == -1) { return -1; }
          }
        }
          else
        {
          print_error_unexp(asm_context, token);
        }

        if (skip_case == 0)
        {
          switch (num_size)
          {
            case NUM_SIZE_SHORT:
              if (is_w == 0 && is_e != 1)
              {
                print_error_illegal_operands(asm_context, instr);
                return -1;
              }
              break;
            case NUM_SIZE_WORD:
              operands[operand_count].type++;
              if (is_w == 0) { operands[operand_count].type++; }
              break;
            default:
              // FIXME - bad error message
              //print_error_range(asm_context, instr, 0, 0xffff);
              //return -1;
              break;
          }
        }
      }
        else
      if (strcasecmp(token,"X") == 0)
      {
        operands[operand_count].type = OP_INDEX_X;
      }
        else
      if (strcasecmp(token,"Y") == 0)
      {
        operands[operand_count].type = OP_INDEX_Y;
      }
        else
      {
        tokens_push(asm_context, token, token_type);

        if (get_num(asm_context, instr_index, &n, &num_size) != 0)
        {
          return -1;
        }

