mikeakohn/naken_asm/asm/stm8.cpp
        operands[operand_count].value = n;
        operands[operand_count].num_size = num_size;

        if (expect_token(asm_context, ',') == -1) { return -1; }

        token_type = tokens_get(asm_context, token, TOKENLEN);
        if (strcasecmp(token,"X") == 0)
        {
          operands[operand_count].type = OP_OFFSET8_INDEX_X;
        }
          else
        if (strcasecmp(token,"Y") == 0)
        {
          operands[operand_count].type = OP_OFFSET8_INDEX_Y;
        }
          else
        if (strcasecmp(token,"SP") == 0)
        {
          operands[operand_count].type = OP_OFFSET8_INDEX_SP;
        }
          else
        {
          print_error_unexp(asm_context, token);
          return -1;
        }

        switch (num_size)
        {
          case NUM_SIZE_SHORT: break;
          case NUM_SIZE_WORD: operands[operand_count].type++; break;
          case NUM_SIZE_EXTENDED: operands[operand_count].type += 2; break;
          default:
            // FIXME - bad error message
            //print_error_range(asm_context, instr, 0, 0xff);
            //return -1;
            break;
        }
      }

      if (expect_token(asm_context, ')') == -1) { return -1; }
    }
      else
    if (IS_TOKEN(token,'['))
    {
      if (get_num(asm_context, instr_index, &n, &num_size) != 0)
      {
        return -1;
      }

      switch (num_size)
      {
        case NUM_SIZE_SHORT:
          operands[operand_count].type = OP_INDIRECT8; break;
        case NUM_SIZE_WORD:
          operands[operand_count].type = OP_INDIRECT16; break;
        default:
          // FIXME - bad error message
          //print_error_range(asm_context, instr, 0, 0xff);
          //return -1;
          operands[operand_count].type = OP_INDIRECT8; break;
          break;
      }

      operands[operand_count].value = n;
      operands[operand_count].num_size = num_size;

      token_type = tokens_get(asm_context, token, TOKENLEN);
      if (IS_TOKEN(token,'.'))
      {
        token_type = tokens_get(asm_context, token, TOKENLEN);
        if (strcasecmp(token, "e") == 0)
        {
          operands[operand_count].type = OP_INDIRECT16_E;
        }
          else
        if (strcasecmp(token, "w") != 0)
        {
          print_error_unexp(asm_context, token);
          return -1;
        }
      }
        else
      {
        tokens_push(asm_context, token, token_type);
      }
      if (expect_token(asm_context, ']') == -1) { return -1; }
    }
      else
    {
      tokens_push(asm_context, token, token_type);

      if (get_num(asm_context, instr_index, &n, &num_size) != 0)
      {
        return -1;
      }

      switch (num_size)
      {
        case NUM_SIZE_SHORT:
          operands[operand_count].type = OP_ADDRESS8; break;
        case NUM_SIZE_WORD:
          operands[operand_count].type = OP_ADDRESS16; break;
        case NUM_SIZE_EXTENDED:
          operands[operand_count].type = OP_ADDRESS24; break;
        default:
          // FIXME - bad error message
          //print_error_range(asm_context, instr, 0, 0xff);
          //return -1;
          operands[operand_count].type = OP_ADDRESS8; break;
      }

      operands[operand_count].value = n;
      operands[operand_count].num_size = num_size;
    }

    operand_count++;
  }

  // Check for an unknown size
  has_unknown_size = 0;
  for (n = 0; n < operand_count; n ++)
  {
    if (operands[n].num_size == NUM_SIZE_UNKNOWN)
    {
      has_unknown_size = 1;
    }
  }

  // Get opcodes
  n = 0;
  while (table_stm8_opcodes[n].instr_enum != STM8_NONE)
  {
    if (table_stm8_opcodes[n].instr_enum == instr_enum)
    {
      if (table_stm8_opcodes[n].dest != OP_NONE &&
          operands[0].type != table_stm8_opcodes[n].dest)
      {
        n++;
        continue;
      }

      if (table_stm8_opcodes[n].src != OP_NONE &&
          operands[1].type != table_stm8_opcodes[n].src)
      {
        n++;
        continue;
      }

      if (has_unknown_size == 1)
      {
        // Check if the next instruction is a bigger version
        if (table_stm8_opcodes[n].instr_enum ==
            table_stm8_opcodes[n+1].instr_enum)
        {
          n = find_bigger_instruction(n);
        }
      }

      switch (table_stm8_opcodes[n].type)
      {
        case OP_NONE:
        {
          if (operand_count == 0)
          {
            return add_bin_void(asm_context, n);
          }
          break;
        }
        case OP_NUMBER8:
        {
          if (operand_count <= 2 && operands[0].type == OP_NUMBER8)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_NUMBER8)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_NUMBER16:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_NUMBER16 ||
               operands[0].type == OP_NUMBER8))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_NUMBER16 ||
               operands[1].type == OP_NUMBER8))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS8:
        {
          if (operand_count <= 2 && operands[0].type == OP_ADDRESS8)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_ADDRESS8)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS16:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_ADDRESS16 ||
               operands[0].type == OP_ADDRESS8))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_ADDRESS16 ||
               operands[1].type == OP_ADDRESS8))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS24:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_ADDRESS24 ||
               operands[0].type == OP_ADDRESS16 ||
               operands[0].type == OP_ADDRESS8))
          {
            return add_bin_num24(asm_context, n, operands[0].value);
          }
          if (operand_count == 2 &&
              (operands[1].type == OP_ADDRESS24 ||
               operands[1].type == OP_ADDRESS16 ||
               operands[1].type == OP_ADDRESS8))
          {
            return add_bin_num24(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDEX_X:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_INDEX_X ||
               operands[1].type == OP_INDEX_X))
          {
            return add_bin_void(asm_context, n);
          }
          break;
        }
        case OP_OFFSET8_INDEX_X:
        {
          if (operand_count <= 2 && operands[0].type == OP_OFFSET8_INDEX_X)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_OFFSET8_INDEX_X)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_OFFSET16_INDEX_X:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_OFFSET16_INDEX_X ||
               operands[0].type == OP_OFFSET8_INDEX_X))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_OFFSET16_INDEX_X ||
               operands[1].type == OP_OFFSET8_INDEX_X))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_OFFSET24_INDEX_X:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_OFFSET24_INDEX_X ||
               operands[0].type == OP_OFFSET16_INDEX_X ||
               operands[0].type == OP_OFFSET8_INDEX_X))
          {
            return add_bin_num24(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_OFFSET24_INDEX_X ||
               operands[1].type == OP_OFFSET16_INDEX_X ||
               operands[1].type == OP_OFFSET8_INDEX_X))
          {
            return add_bin_num24(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDEX_Y:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_INDEX_Y ||
               operands[1].type == OP_INDEX_Y))
          {
            return add_bin_void(asm_context, n);
          }
          break;
        }
        case OP_OFFSET8_INDEX_Y:
        {
          if (operand_count <= 2 && operands[0].type == OP_OFFSET8_INDEX_Y)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_OFFSET8_INDEX_Y)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_OFFSET16_INDEX_Y:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_OFFSET16_INDEX_Y ||
               operands[0].type == OP_OFFSET8_INDEX_Y))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_OFFSET16_INDEX_Y ||
               operands[1].type == OP_OFFSET8_INDEX_Y))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_OFFSET24_INDEX_Y:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_OFFSET24_INDEX_Y ||
               operands[0].type == OP_OFFSET16_INDEX_Y ||
               operands[0].type == OP_OFFSET8_INDEX_Y))
          {
            return add_bin_num24(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_OFFSET24_INDEX_Y ||
               operands[1].type == OP_OFFSET16_INDEX_Y ||
               operands[1].type == OP_OFFSET8_INDEX_Y))
          {
            return add_bin_num24(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_OFFSET8_INDEX_SP:
        {
          if (operand_count <= 2 && operands[0].type == OP_OFFSET8_INDEX_SP)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_OFFSET8_INDEX_SP)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT8:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT8)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT8)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT16:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_INDIRECT16 ||
               operands[0].type == OP_INDIRECT8))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_INDIRECT16 ||
               operands[1].type == OP_INDIRECT8))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT16_E:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT16_E)
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT16_E)
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT8_X:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT8_X)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT8_X)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT16_X:
        {
          if (operand_count <= 2 &&
              (operands[0].type == OP_INDIRECT16_X ||
               operands[0].type == OP_INDIRECT8_X))
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 &&
              (operands[1].type == OP_INDIRECT16_X ||
               operands[1].type == OP_INDIRECT8_X))
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT16_E_X:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT16_E_X)
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT16_E_X)
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT8_Y:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT8_Y)
          {
            return add_bin_num8(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT8_Y)
          {
            return add_bin_num8(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_INDIRECT16_E_Y:
        {
          if (operand_count <= 2 && operands[0].type == OP_INDIRECT16_E_Y)
          {
            return add_bin_num16(asm_context, n, operands[0].value);
          }
            else
          if (operand_count == 2 && operands[1].type == OP_INDIRECT16_E_Y)
          {
            return add_bin_num16(asm_context, n, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS_BIT:
        {
          if (operand_count == 2 &&
              (operands[0].type == OP_ADDRESS8 ||
               operands[0].type == OP_ADDRESS16) &&
              operands[1].type == OP_NUMBER8)
          {
            if (operands[1].value < 0 || operands[1].value > 7)
            {
              print_error_range(asm_context, "Bit", 0, 7);
              return -1;
            }

            return add_bin_bit(asm_context, n, operands[0].value, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS_BIT_LOOP:
        {
          if (operand_count == 3 &&
              (operands[0].type == OP_ADDRESS8 ||
               operands[0].type == OP_ADDRESS16 ||
               operands[0].type == OP_ADDRESS24) &&
              operands[1].type == OP_NUMBER8 &&
              (operands[2].type == OP_ADDRESS8 ||
               operands[2].type == OP_ADDRESS16))
          {
            if (operands[1].value < 0 || operands[1].value > 7)
            {
              print_error_range(asm_context, "Bit", 0, 7);
              return -1;
            }

            int address = asm_context->address + 4;
            if (table_stm8_opcodes[n].prefix != 0) { address++; }
            int offset = (asm_context->pass == 1) ? 0 : operands[2].value - address;

            if (offset < -128 || offset > 127)
            {
              print_error_range(asm_context, "Offset", -128, 127);
              return -1;
            }

            return add_bin_bit_offset(asm_context, n, operands[0].value, operands[1].value, offset);
          }
          break;
        }
        case OP_RELATIVE:
        {
          if (operand_count == 1 &&
              (operands[0].type == OP_ADDRESS8 ||
               operands[0].type == OP_ADDRESS16 ||
               operands[0].type == OP_ADDRESS24))
          {
            int address = asm_context->address + 2;
            if (table_stm8_opcodes[n].prefix != 0) { address++; }
            int offset = operands[0].value - address;

            if (asm_context->pass == 1)
            {
              offset = 0;
            }
              else
            {
              if (offset < -128 || offset > 127)
              {
                print_error_range(asm_context, "Offset", -128, 127);
                return -1;
              }
            }

            return add_bin_num8(asm_context, n, offset);
          }
          break;
        }
        case OP_SINGLE_REGISTER:
        {
          if (operand_count == 1)
          {
            return add_bin_void(asm_context, n);
          }
          break;
        }
        case OP_TWO_REGISTERS:
        {
          if (operand_count == 2)
          {
            return add_bin_void(asm_context, n);
          }
          break;
        }
        case OP_ADDRESS16_NUMBER8:
        {
          if (operand_count == 2 &&
              (operands[0].type == OP_ADDRESS8 ||
               operands[0].type == OP_ADDRESS16) &&
              operands[1].type == OP_NUMBER8)
          {
            return add_bin_num16_num8(asm_context, n, operands[0].value, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS8_ADDRESS8:
        {
          if (operand_count == 2 &&
              operands[0].type == OP_ADDRESS8 &&
              operands[1].type == OP_ADDRESS8)
          {
            return add_bin_num8_num8(asm_context, n, operands[0].value, operands[1].value);
          }
          break;
        }
        case OP_ADDRESS16_ADDRESS16:
        {
          if (operand_count == 2 &&
              (operands[0].type == OP_ADDRESS8 ||
               operands[0].type == OP_ADDRESS16) &&
              (operands[1].type == OP_ADDRESS8 ||
               operands[1].type == OP_ADDRESS16))
          {
            return add_bin_num16_num16(asm_context, n, operands[0].value, operands[1].value);
          }
          break;
        }
        default:
          printf("Internal error %s:%d\n", __FILE__, __LINE__);
          return -1;
          break;
      }
    }

    n++;
  }

  print_error_unknown_operand_combo(asm_context, instr);

  return -1;
}

